spec/fixtures/files/residential_property/valid_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://suh.softfair-server.de/suhservice" xmlns:per="https://ws.softfair-server.de/PersistenzService">
  <soapenv:Header/>
  <soapenv:Body>
    <GetWgErgebnis>
      <objWgData>
        <Versicherungsbeginn>2017-01-01</Versicherungsbeginn>
        <Versicherungsablauf>2018-01-01</Versicherungsablauf>
        <Geburtsdatum>1980-01-01</Geburtsdatum>
        <Laufzeit>1</Laufzeit>
        <Zahlweise>100</Zahlweise>
        <Haustyp>1206</Haustyp>
        <HasFeuer>true</HasFeuer>
        <HasLeitungswasser>true</HasLeitungswasser>
        <HasSturm>true</HasSturm>
        <HasElementar>true</HasElementar>
        <Bauartklasse>1</Bauartklasse>
        <Wohnflaeche>150</Wohnflaeche>
        <Versicherungssumme1914>26150</Versicherungssumme1914>
        <Neubauwert>0</Neubauwert>
        <Baujahr>2016</Baujahr>
        <Sanierung>99999</Sanierung>
        <SB>500</SB>
        <IsBeamter>false</IsBeamter>
        <HasSchwimmbecken>false</HasSchwimmbecken>
        <HasVerzichtGrobeFahrlaessigkeit>false</HasVerzichtGrobeFahrlaessigkeit>
        <VerzichtGrobeFahrlaessigkeitPRZ>0</VerzichtGrobeFahrlaessigkeitPRZ>
        <IsVnBewohnt>true</IsVnBewohnt>
        <RisikoAdresse>
          <COrt>Clark Town</COrt>
          <CPlz>12345</CPlz>
          <CStrasse>Thingamabob</CStrasse>
          <NAdressTyp>0</NAdressTyp>
          <CHausNr>2332</CHausNr>
        </RisikoAdresse>
        <DachForm>2</DachForm>
        <AnzahlWohnEinheiten>1</AnzahlWohnEinheiten>
        <AnzahlWohnGeschosse>2</AnzahlWohnGeschosse>
        <AnzahlGaragen>1</AnzahlGaragen>
        <AnzahlCarports>1</AnzahlCarports>
        <HasKeller>true</HasKeller>
        <KellerFlaeche>0</KellerFlaeche>
        <KellerGesamtFlaeche>50</KellerGesamtFlaeche>
        <SchwimmbadFlaeche>0</SchwimmbadFlaeche>
        <NebengebaeudeFlaeche>0</NebengebaeudeFlaeche>
        <BauAusstattung>0</BauAusstattung>
        <HasRauchmelder>false</HasRauchmelder>
        <HasEinlieger>false</HasEinlieger>
        <HasZweiAntennenAnlagen>false</HasZweiAntennenAnlagen>
        <HasPhotovoltaik>false</HasPhotovoltaik>
        <FeuerRohbau>0</FeuerRohbau>
        <AufraeumAbbruchKosten>false</AufraeumAbbruchKosten>
        <Aussenverkleidung>false</Aussenverkleidung>
        <VorsorgeAusUmbauten>false</VorsorgeAusUmbauten>
        <BewegungsSchutzKosten>false</BewegungsSchutzKosten>
        <GarageCarport>true</GarageCarport>
        <DarlehenZinsErsatz>false</DarlehenZinsErsatz>
        <Dekontamination>false</Dekontamination>
        <ExterneLagerkosten>false</ExterneLagerkosten>
        <FahrzeugAnprall>false</FahrzeugAnprall>
        <AbsturzFlugkoerper>false</AbsturzFlugkoerper>
        <Implosion>false</Implosion>
        <NutzWaerme>false</NutzWaerme>
        <Sengschaeden>false</Sengschaeden>
        <UberspannungBlitz>false</UberspannungBlitz>
        <Verpuffung>false</Verpuffung>
        <WiederAufforstungFeuer>false</WiederAufforstungFeuer>
        <Gartenhaus>false</Gartenhaus>
        <Graffiti>false</Graffiti>
        <UnbefugteDritte>false</UnbefugteDritte>
        <Hotelkosten>false</Hotelkosten>
        <RegenSchmelzWasser>false</RegenSchmelzWasser>
        <InnereUnruhen>false</InnereUnruhen>
        <WaermetragendeFluesigkeiten>false</WaermetragendeFluesigkeiten>
        <WaschmaschinenSchlauch>false</WaschmaschinenSchlauch>
        <WaschmaschineKeller>true</WaschmaschineKeller>
        <Wasserbett>false</Wasserbett>
        <WasserverlustBruchZuleitung>false</WasserverlustBruchZuleitung>
        <AufraeumkostenBaeume>false</AufraeumkostenBaeume>
        <GlasbruchSturmHagel>false</GlasbruchSturmHagel>
        <SturmSchadenAussen>false</SturmSchadenAussen>
        <SturmWurfSchaeden>false</SturmWurfSchaeden>
        <WiederaufforstungSturm>false</WiederaufforstungSturm>
        <VerkehrsSicherung>false</VerkehrsSicherung>
        <Ueberschallknall>false</Ueberschallknall>
        <SchadenabwendungMinderung>false</SchadenabwendungMinderung>
        <SachverstaendigenKosten>false</SachverstaendigenKosten>
        <RueckreisekostenUrlaub>false</RueckreisekostenUrlaub>
        <MehrkostenPreisSteigerung>false</MehrkostenPreisSteigerung>
        <MehrkostenBehAuflagen>false</MehrkostenBehAuflagen>
        <MietausfallWohnraum>0</MietausfallWohnraum>
        <Erdbeben>true</Erdbeben>
        <Erdfall>true</Erdfall>
        <Erdrutsch>true</Erdrutsch>
        <RueckstauNiederschlag>true</RueckstauNiederschlag>
        <RueckstauOberirdischeGew>true</RueckstauOberirdischeGew>
        <UeberschwemmungNiederschlag>true</UeberschwemmungNiederschlag>
        <UeberschwemmungOberirdischeGew>true</UeberschwemmungOberirdischeGew>
        <Lawinen>true</Lawinen>
        <Schneedruck>true</Schneedruck>
        <Denkmalgeschuetzt>false</Denkmalgeschuetzt>
        <VorschadenAnzahlSturmHagel>0</VorschadenAnzahlSturmHagel>
        <VorschadenAnzahlLeitungswasser>0</VorschadenAnzahlLeitungswasser>
        <VorschadenAnzahlFeuer>0</VorschadenAnzahlFeuer>
      </objWgData>
    </GetWgErgebnis>
  </soapenv:Body>
</soapenv:Envelope>
